Tekla Open API Reference for Tekla Structures 2025
IFC2X3_ParametricObject_CShapeProfile Class
 The IFC2X3_ParametricObject_CShapeProfile class contains the C-shape profile definition.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Collaboration.ReferenceModelObjectAttribute
 Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_CShapeProfile
 Namespace: Tekla.Structures.Model.Collaboration
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class IFC2X3_ParametricObject_CShapeProfile : ReferenceModelObjectAttribute
<SerializableAttribute>
Public NotInheritable Class IFC2X3_ParametricObject_CShapeProfile
	Inherits ReferenceModelObjectAttribute
The IFC2X3_ParametricObject_CShapeProfile type exposes the following members.
Properties
Name | Description
Depth
 The depth.
Description
 The description of the product.
 (Inherited from ReferenceModelObjectAttribute.)
Extrusion
 The extrusion vector.
 (Inherited from ReferenceModelObjectAttribute.)
Girth
 The girth.
InternalFilletRadius
 The internal fillet radius.
Name
 The name of the product.
 (Inherited from ReferenceModelObjectAttribute.)
ObjectType
 The object type of the product.
 (Inherited from ReferenceModelObjectAttribute.)
Origin
 The origin of the extrusion.
 (Inherited from ReferenceModelObjectAttribute.)
ProfileName
 The name of the profile (often empty).
 (Inherited from ReferenceModelObjectAttribute.)
WallThickness
 The wall thickness.
Width
 The width.
xDir
 The X-axis direction.
 (Inherited from ReferenceModelObjectAttribute.)
Top
See Also
Reference
Tekla.Structures.Model.Collaboration Namespace